{
  "basics": {
    "name": "Tan Huoyuan",
    "label": "",
    "image": "",
    "email": "tanhuoyuan@gmail.com",
    "phone": "(+46)0762497727",
    "url": "https://huoyuantan.github.io",
    "summary": ""
  },
  "work": [
    {
      "name": "Xingyun Intelligence (Shenzhen) Technology Co., Ltd.",
      "position": "Algorithm Engineer",
      "location": "Shenzhen, China",
      "url": "http://arrive.ai",
      "startDate": "2017-02-08",
      "endDate": "2022-10-08",
      "summary": "Investigated and developed algorithms for the company's products, including AGV, ART, IGV etc."
    }
  ],
  "education": [
    {
      "institution": "Guangzhou University of Chinese Medicine",
      "location": "Guangzhou, China",
      "url": "https://www.gzucm.edu.cn",
      "area": "Medical Information Engineering",
      "studyType": "Bachelor",
      "startDate": "2013-09-01",
      "endDate": "2017-06-30",
      "score": "",
      "courses": ["Java, C, C#, Data Structures and Algorithms, Database Design and Management, Networking, Operating System etc."]
    },
    {
      "institution": "University of Gothenburg",
      "location": "Gothenburg, Sweden",
      "url": "https://www.gu.se",
      "area": "Computer Science and Engeneering",
      "studyType": "Master",
      "startDate": "2024-09-01",
      "endDate": "current",
      "score": "",
      "courses": ["Design of AI systems, Advanced topics in machine learning, Autonomous and cooperative vehicular systems, Discrete optimization, Advanced algorithms etc."]
    }
  ],

  "publications": [
    {
      "name": "Abnormal Activity Detection Using Pyroelectric Infrared Sensors",
      "publisher": "Sensors",
      "releaseDate": "2016",
      "url": "https://www.mdpi.com/1424-8220/16/6/822",
      "summary": "Healthy aging is one of the most important social issues. In this paper, we propose a method for abnormal activity detection without any manual labeling of the training samples. By leveraging the Field of View (FOV) modulation, the spatio-temporal characteristic of human activity is encoded into low-dimension data stream generated by the ceiling-mounted Pyroelectric Infrared (PIR) sensors. The similarity between normal training samples are measured based on Kullback-Leibler (KL) divergence of each pair of them. The natural clustering of normal activities is discovered through a self-tuning spectral clustering algorithm with unsupervised model selection on the eigenvectors of a modified similarity matrix. Hidden Markov Models (HMMs) are employed to model each cluster of normal activities and form feature vectors. One-Class Support Vector Machines (OSVMs) are used to profile the normal activities and detect abnormal activities. To validate the efficacy of our method, we conducted experiments in real indoor environments. The encouraging results show that our method is able to detect abnormal activities given only the normal training samples, which aims to avoid the laborious and inconsistent data labeling process."
    },
    {
      "name": "Simultaneous Indoor Tracking and Activity Recognition Using Pyroelectric Infrared Sensors",
      "publisher": "Sensors",
      "releaseDate": "2017",
      "url": "https://www.mdpi.com/1424-8220/17/8/1738",
      "summary": "Indoor human tracking and activity recognition are fundamental yet coherent problems for ambient assistive living. In this paper, we propose a method to address these two critical issues simultaneously. We construct a wireless sensor network (WSN), and the sensor nodes within WSN consist of pyroelectric infrared (PIR) sensor arrays. To capture the tempo-spatial information of the human target, the field of view (FOV) of each PIR sensor is modulated by masks. A modified partial filter algorithm is utilized to decode the location of the human target. To exploit the synergy between the location and activity, we design a two-layer random forest (RF) classifier. The initial activity recognition result of the first layer is refined by the second layer RF by incorporating various effective features. We conducted experiments in a mock apartment. The mean localization error of our system is about 0.85 m. For five kinds of daily activities, the mean accuracy for 10-fold cross-validation is above 92%. The encouraging results indicate the effectiveness of our system."
    }
  ],
  "skills": [
    {
      "name": "Computer Science",
      "level": "",
      "icon": "",
      "keywords": [
        "C++, Python",
        "Industrial Autonomous Driving",
        "ROS, SLAM, Perception, Planning, DevOps",
        "Maching Learning",
        "Deep Learning",
        "Linux"
      ]
    }
  ],
  "languages": [
    {
      "language": "Chinese Mandarin",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "Cantonese",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Independent user; B2",
      "icon": ""
    }
  ],

  "projects": [
    {
      "name": "The intelligent home system based on pyroelectric infrared sensors",
      "summary": "This project aimed to design a device for simultaneous indoor tracking and abnormal activity detection for the elderly to get timely assistance when they get ill or hurt in their houses.",
      "highlights": ["Pyroelectric Infrared Sensor", "Abnormal Activity Detection", "Indoor Tracking", "WWireless Sensor Network", "One-Class Support Vector Machines (OSVMs)", "Random Forest"],
      "startDate": "2015-06",
      "endDate": "2017-02",
      "url": ""
    },

    {
      "name": "Self-Unloading Forklift",
      "summary": "This project was to develop an intelligent self-unloading forklift by integrating forklifts, roadside units, and cloud service for automatically unloading goods from trucks at a highly efficient and lower cost.",
      "highlights": ["Model Predictive Control(MPC)", "Radars, Cameras Confusions"],
      "startDate": "2021-11",
      "endDate": "2022-10",
      "url": ""
    },

    {
      "name": "Artificial Intelligence Robot for Transportation (ART)",
      "summary": "This project aimed to develop ART that would contribute to constructing intelligent ports in energy-saving, environment-friendly and cost-control measures.",
      "highlights": ["ROS", "SLAM", "Perception", "Planning", "DevOps"],
      "startDate": "2020-10",
      "endDate": "2022-10",
      "url": ""
    },

    {
      "name": "Automated Guided Vehicle (AGV)",
      "summary": "This project was to develop AGV applicable to materials transfer automatically within factory.",
      "highlights": ["IMU", "SLAM", "LADARs", "initial pose", "keyframe", "changing environments"],
      "startDate": "2018-05",
      "endDate": "2020-05",
      "url": ""
    }
  ]
}
